package by.aleksey.project.ibankingapp.io;

import java.io.IOException;

public interface IOInterface {

    String MENU =
            "Выберите действие:\n" +
                    "------------------------\n" +
                    "1. Карты\n" +
                    "2. Переводы\n" +
                    "3. История операций\n" +
                    "4. Электронные депозиты\n" +
                    "5. Курсы валют\n" +
                    "6. Выход";

    String MENU_TRANSFER_TO_CARD =
            "Выберите действие:\n" +
                    "-----------------\n" +
                    "1. На свою карту\n" +
                    "2. По номеру карты\n" +
                    "3. Назад";

    String MENU_DEPOSIT =
            "Выберите действие:\n" +
                    "-----------------\n" +
                    "1. Информация по депозитам\n" +
                    "2. Открыть новый депозит\n" +
                    "3. Назад";

    String CURRENCY_OF_DEPOSIT =
            "Выберите валюту депозита\n" +
                    "1. В белорусских рублях\n" +
                    "2. В долларах США";

    String TERM_OF_DEPOSIT_IN_BYN =
            "Введите срок депозита, месяцев\n" +
                    "12 месяцев, ставка 13% годовых\n" +
                    "24 месяцв, ставка 14% годовых\n" +
                    "36 месяцев, ставка 15% годовых";

    String TERM_OF_DEPOSIT_IN_USD =
            "Введите срок депозита, месяцев\n" +
                    "1. 12 месяцев, ставка 0,5% годовых\n" +
                    "2. 24 месяцв, ставка 1,0% годовых\n" +
                    "3. 36 месяцев, ставка 1,5% годовых";


    String readLine() throws IOException;

}

